MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX5109BZ31048/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M4 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnRTC_Handler;                          /*   0 Real-Time Counter (RTC) */
  void* pfnEIC_Handler;                          /*   1 External Interrupt Controller (EIC) */
  void* pfnFREQM_Handler;                        /*   2 Frequency Meter (FREQM) */
  void* pfnNVM_Handler;                          /*   3 flash controller (NVM) */
  void* pfnCHANGE_NOTICE_A_Handler;              /*   4 GPIO (GPIOA) */
  void* pfnCHANGE_NOTICE_B_Handler;              /*   5 GPIO (GPIOB) */
  void* pfnDMAC_0_3_Handler;                     /*   6 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_4_15_Handler;                    /*   7 Direct Memory Access Controller (DMAC) */
  void* pfnEVSYS_0_3_Handler;                    /*   8 Event System Interface (EVSYS) */
  void* pfnEVSYS_4_11_Handler;                   /*   9 Event System Interface (EVSYS) */
  void* pfnPAC_Handler;                          /*  10 Peripheral Access Controller (PAC) */
  void* pfnRAMECC_Handler;                       /*  11 RAM ECC (RAMECC) */
  void* pfnSERCOM0_Handler;                      /*  12 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_Handler;                      /*  13 Serial Communication Interface (SERCOM1) */
  void* pfnTCC0_Handler;                         /*  14 Timer Counter Control (TCC0) */
  void* pfnTCC1_Handler;                         /*  15 Timer Counter Control (TCC1) */
  void* pfnTCC2_Handler;                         /*  16 Timer Counter Control (TCC2) */
  void* pfnTC0_Handler;                          /*  17 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  18 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  19 Basic Timer Counter (TC2) */
  void* pfnTC3_Handler;                          /*  20 Basic Timer Counter (TC3) */
  void* pfnTC4_Handler;                          /*  21 Basic Timer Counter (TC4) */
  void* pfnTC5_Handler;                          /*  22 Basic Timer Counter (TC5) */
  void* pfnTC6_Handler;                          /*  23 Basic Timer Counter (TC6) */
  void* pfnTC7_Handler;                          /*  24 Basic Timer Counter (TC7) */
  void* pfnADCHS_IRQ_Handler;                    /*  25 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnAC_Handler;                           /*  26 Analog Comparators (AC) */
  void* pfnSILEX_0_Handler;                      /*  27  (SILEX) */
  void* pfnSILEX_1_Handler;                      /*  28  (SILEX) */
  void* pfnQSPI_Handler;                         /*  29 Quad SPI interface (QSPI) */
  void* pfnZB_INT0_Handler;                      /*  30 ZigBee MAC DOS (ZIGBEE) */
  void* pfnBT_INT0_Handler;                      /*  31 BLE (BLE) */
  void* pfnBT_INT1_Handler;                      /*  32 BLE (BLE) */
  void* pfnARBITER_Handler;                      /*  33 Radio Arbiter (ARB) */
  void* pfnADCHS_FAULT_Handler;                  /*  34 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnADCHS_FCC_Handler;                    /*  35 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnADCHS_BGVR_RDY_Handler;               /*  36 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnCLKI_WAKEUP_NMI_Handler;              /*  37 BLE (BLE) */
  void* pfnCVD_Handler;                          /*  38 Hardware CVD Controller Macro (CVD) */
  void* pfnDGI_SPI_Handler;                      /*  39 SPI DMA for DGI Macro (DGI_SPI) */
  void* pfnSERCOM2_Handler;                      /*  40 Serial Communication Interface (SERCOM2) */
  void* pvReserved41;
  void* pfnBT_LC_Handler;                        /*  42 BLE (BLE) */
} DeviceVectors;

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M4 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void FREQM_Handler                 ( void );
void NVM_Handler                   ( void );
void CHANGE_NOTICE_A_Handler       ( void );
void CHANGE_NOTICE_B_Handler       ( void );
void DMAC_0_3_Handler              ( void );
void DMAC_4_15_Handler             ( void );
void EVSYS_0_3_Handler             ( void );
void EVSYS_4_11_Handler            ( void );
void PAC_Handler                   ( void );
void RAMECC_Handler                ( void );
void SERCOM0_Handler               ( void );
void SERCOM1_Handler               ( void );
void TCC0_Handler                  ( void );
void TCC1_Handler                  ( void );
void TCC2_Handler                  ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TC3_Handler                   ( void );
void TC4_Handler                   ( void );
void TC5_Handler                   ( void );
void TC6_Handler                   ( void );
void TC7_Handler                   ( void );
void ADCHS_IRQ_Handler             ( void );
void AC_Handler                    ( void );
void SILEX_0_Handler               ( void );
void SILEX_1_Handler               ( void );
void QSPI_Handler                  ( void );
void ZB_INT0_Handler               ( void );
void BT_INT0_Handler               ( void );
void BT_INT1_Handler               ( void );
void ARBITER_Handler               ( void );
void ADCHS_FAULT_Handler           ( void );
void ADCHS_FCC_Handler             ( void );
void ADCHS_BGVR_RDY_Handler        ( void );
void CLKI_WAKEUP_NMI_Handler       ( void );
void CVD_Handler                   ( void );
void DGI_SPI_Handler               ( void );
void SERCOM2_Handler               ( void );
void BT_LC_Handler                 ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M4 Processor and Core Peripherals */
#define __CM4_REV                     0x0001 /*                                                                           */
#define __DEBUG_LVL                        3 /*                                                                           */
#define __FPU_PRESENT                      1 /*                                                                           */
#define __MPU_PRESENT                      1 /*                                                                           */
#define __NVIC_PRIO_BITS                   3 /*                                                                           */
#define __TRACE_LVL                        2 /*                                                                           */
#define __VTOR_PRESENT                     1 /*                                                                           */

